#### CeramicApplicationType Enumeration

---

|  |
| --- |
| See Also |

The enumerated type representing the permitted values for the asset property "CeramicApplication" from the "Ceramic" schema.

**Namespace:**   Autodesk.Revit.DB.Visual
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)

# Syntax

| C# |
| --- |
| ``` public enum CeramicApplicationType ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration CeramicApplicationType ``` |

| Visual C++ |
| --- |
| ``` public enum class CeramicApplicationType ``` |

# Members

| Member name | Description |
| --- | --- |
| HighGlossy |  |
| Satin |  |
| Matte |  |

# See Also

Autodesk.Revit.DB.Visual Namespace